Анализ данных по Титанику

In [1]:
import pandas as pd

In [3]:
# загрузка данных из файла
data_0 = pd.read_csv("data/titanic.csv")
data_0.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [4]:
data_0.shape

(891, 15)

In [5]:
data_0.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

In [6]:
# удаление строк и столбцов с Nan(пустыми значения) или замена Nan
df = pd.DataFrame({
    "c0": {"r0": 100, "r1": 200, "r2": 300},
    "c1": {"r1": 400, "r2": 500},
    "c2": {"r0": 600, "r2": 700}
})
df

     c0     c1     c2
r0  100    NaN  600.0
r1  200  400.0    NaN
r2  300  500.0  700.0

In [7]:
# удаление строк с пустыми значениями
df.dropna()

     c0     c1     c2
r2  300  500.0  700.0

In [8]:
# удаление столбцов с пустыми значениями
df.dropna(axis=1)

     c0
r0  100
r1  200
r2  300

In [9]:
# замена пустых значений на другое значение
df.fillna(0)

     c0     c1     c2
r0  100    0.0  600.0
r1  200  400.0    0.0
r2  300  500.0  700.0

In [10]:
# удаление строк по индексам
df.drop("r0")

     c0     c1     c2
r1  200  400.0    NaN
r2  300  500.0  700.0

In [11]:
df.drop(["r0", "r2"])

     c0     c1  c2
r1  200  400.0 NaN

In [12]:
# удаление столбцов по ключам
df.drop("c1", axis=1)

     c0     c2
r0  100  600.0
r1  200    NaN
r2  300  700.0

- Очистка данных

In [13]:
data_0.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [15]:
# удаление ненужных столбцов
data_1 = data_0.drop(['sibsp', 'parch', 'embarked', 'class', 'adult_male', 'deck', 'alive'], axis=1)
data_1.head()

   survived  pclass     sex   age     fare    who  embark_town  alone
0         0       3    male  22.0   7.2500    man  Southampton  False
1         1       1  female  38.0  71.2833  woman    Cherbourg  False
2         1       3  female  26.0   7.9250  woman  Southampton   True
3         1       1  female  35.0  53.1000  woman  Southampton  False
4         0       3    male  35.0   8.0500    man  Southampton   True

In [16]:
data_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   fare         891 non-null    float64
 5   who          891 non-null    object
 6   embark_town  889 non-null    object
 7   alone        891 non-null    bool
dtypes: bool(1), float64(2), int64(2), object(3)
memory usage: 49.7+ KB

In [17]:
# удаление строк с пустыми значениями
# data_1 = data_1.dropna()
data_1.dropna(inplace=True)
data_1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 712 entries, 0 to 890
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     712 non-null    int64
 1   pclass       712 non-null    int64
 2   sex          712 non-null    object
 3   age          712 non-null    float64
 4   fare         712 non-null    float64
 5   who          712 non-null    object
 6   embark_town  712 non-null    object
 7   alone        712 non-null    bool
dtypes: bool(1), float64(2), int64(2), object(3)
memory usage: 45.2+ KB

In [18]:
# проверка на дубликаты
data_1.duplicated().sum()

38

In [19]:
# удаление дубликатов
data_1.drop_duplicates(inplace=True)

In [20]:
data_1.duplicated().sum()

0

In [21]:
data_1.shape

(674, 8)

- Анализ данных

In [22]:
data_1.columns

Index(['survived', 'pclass', 'sex', 'age', 'fare', 'who', 'embark_town',
       'alone'],
      dtype='object')

In [23]:
data_1.head()

   survived  pclass     sex   age     fare    who  embark_town  alone
0         0       3    male  22.0   7.2500    man  Southampton  False
1         1       1  female  38.0  71.2833  woman    Cherbourg  False
2         1       3  female  26.0   7.9250  woman  Southampton   True
3         1       1  female  35.0  53.1000  woman  Southampton  False
4         0       3    male  35.0   8.0500    man  Southampton   True

In [28]:
# сколько выживших в таблице
# data_1.survived.sum()
num_surv = data_1["survived"].sum()
num_surv

281

In [30]:
# процент выживаемости 
num_surv / data_1.shape[0] * 100

41.69139465875371

In [31]:
# минимальный, средний, максимальный возрасты
data_1["age"].min(), data_1["age"].mean(), data_1["age"].max()

(0.42, 29.752848664688425, 80.0)

In [32]:
data_1.columns

Index(['survived', 'pclass', 'sex', 'age', 'fare', 'who', 'embark_town',
       'alone'],
      dtype='object')

In [33]:
# значение столбца "survived" при условии "age" == 0.42
mask = data_1["age"] == 0.42
data_1.loc[mask,"survived"]

803    1
Name: survived, dtype: int64

In [34]:
data_1.loc[mask, :]

     survived  pclass   sex   age    fare    who embark_town  alone
803         1       3  male  0.42  8.5167  child   Cherbourg  False

In [38]:
# узнаем данные по детям до 1 года
mask = data_1["age"] <= 1
data_1.loc[mask, :]

     survived  pclass     sex   age      fare    who  embark_town  alone
78          1       2    male  0.83   29.0000  child  Southampton  False
164         0       3    male  1.00   39.6875  child  Southampton  False
172         1       3  female  1.00   11.1333  child  Southampton  False
183         1       2    male  1.00   39.0000  child  Southampton  False
305         1       1    male  0.92  151.5500  child  Southampton  False
381         1       3  female  1.00   15.7417  child    Cherbourg  False
386         0       3    male  1.00   46.9000  child  Southampton  False
469         1       3  female  0.75   19.2583  child    Cherbourg  False
755         1       2    male  0.67   14.5000  child  Southampton  False
788         1       3    male  1.00   20.5750  child  Southampton  False
803         1       3    male  0.42    8.5167  child    Cherbourg  False
827         1       2    male  1.00   37.0042  child    Cherbourg  False
831         1       2    male  0.83   18.7500  child  Southampton  False

In [39]:
# узнаем данные по детям до 10 до 18 лет
mask = (data_1["age"] >= 10) & (data_1["age"] <= 18)
data_1.loc[mask, :]

     survived  pclass     sex   age     fare    who  embark_town  alone
9           1       2  female  14.0  30.0708  child    Cherbourg  False
14          0       3  female  14.0   7.8542  child  Southampton   True
22          1       3  female  15.0   8.0292  child   Queenstown   True
38          0       3  female  18.0  18.0000  woman  Southampton  False
39          1       3  female  14.0  11.2417  child    Cherbourg  False
..        ...     ...     ...   ...      ...    ...          ...    ...
834         0       3    male  18.0   8.3000    man  Southampton   True
841         0       2    male  16.0  10.5000    man  Southampton   True
853         1       1  female  16.0  39.4000  woman  Southampton  False
855         1       3  female  18.0   9.3500  woman  Southampton  False
875         1       3  female  15.0   7.2250  child    Cherbourg   True

[74 rows x 8 columns]

In [40]:
data_1.columns

Index(['survived', 'pclass', 'sex', 'age', 'fare', 'who', 'embark_town',
       'alone'],
      dtype='object')

In [43]:
# GroupBy

data_1.groupby("survived")[['age', 'pclass']].mean()

                age    pclass
survived
0         30.874046  2.478372
1         28.184769  1.871886